Autodesk.Revit.DB.Mechanical.Zone.GetDomainData
Gets the domain data for the zone.
Returns:
Returns a pointer to the base class for specific domain requirements for the zone.
Since:
2023

Autodesk.Revit.DB.Mechanical.Zone.CreateAreaBasedLoad(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of an area based load and adds it to the document.
doc:
The document where the element will be created and added.
name:
The name of the area based load to be created.
levelId:
The base level on which the area based load will be created.
phaseId:
The associative phase on which the area based load is to exist.
Returns:
The newly created area based load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
-or-
The ElementId levelId is not a Level.
-or-
The id does not represent a valid phase.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2023

Autodesk.Revit.DB.Mechanical.Zone
A zone is a collection of one or more spaces.
Remarks:
The concept of zones is central to the way in which engineers
design HVAC systems. When you are designing HVAC systems, you
relate to zones as spaces that are under the same thermostatic
control. Conceptually, zones are an arbitrary set of areas or
volumes within a building that is controlled by one thermostat.
An area based load is a collection of one or more electrical
load areas. When it has the AreaBasedLoadData, it is an area
based load, otherwise, it is a zone.